'''
7–11. 定义。什么组成字典中合法的键? 举例说明字典中合法的键和非法的键。
'''

'''
Solution: 可哈希的类型实例对象可以作为字典的合法键，包括所有的不可变类型和某些实现了__hash__()特殊方法的类。
不可变类型如数字、字符串可以作为字典有效键，其中值相同的数字表示相同的键，如整数1和浮点数1.0是同一个键，因为
它们的hash值相同。而元组只有其每个元素均为不可变类型时才可以作为字典的有效键，比如(1, 'hello')合法，而
([1, 2], 'a')就不合法。
'''

def main():
    keys = [1, 1.0, '2', (1, '2'), [1, 2], ([1], 2)]
    for key in keys:
        try:
            print('hash({}) = '.format(key), end=' ')
            v = hash(key)
            print(v)
        except TypeError as err:
            print('**Error: ', err)

if __name__ == '__main__':
    main()
    
            