'''
字典的键。我们知道字典的值可以是任意的Python 对象，那字典的键又如何呢？请试
着将除数字和字符串以外的其他不同类型的对象作为字典的键，看一看，哪些类型可以，哪些不行？
对那些不能作字典的键的对象类型，你认为是什么原因呢？
'''

'''
Solution:
不可变类型(数字、字符串等)、只包含不可变类型元素的元组可以作为字典的键，而列表、字典以及包含可变类型元素的元组均不可以作为字典的键。
原因是后者都是不可哈希的。
'''

def test_keys():
    keys = [['1', '2'], (1, '2'), ([2], 2), set([1, 2]), {'a':1, 'b':[1, 2]}, {'a':2}]
    d = dict()
    for key in keys:
        try:
            print(key,end=' ')
            d[key] = 1
            print('is ok!')
        except TypeError as err:
            print(err)

if __name__ == '__main__':
    test_keys()
    